PrInfRa3e6/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 300;
    }
    ceiling
    {
        type            fixedValue;
        value           uniform 0;
    }
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
}
}

// ************************************************************************* //
