PrInfRa3e6/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
cp 0/T.orig 0/T
convectiveFoam1.0 > log.convectiveFoam1.0 &
#------------------------------------------------------------------------------
